<?php

class LogModel extends BaseModel
{
	protected $_tbname = 'zm_log';
	protected $_p_k = 'id';
	public $log_type = array('001' => '用户登录', '002' => '用户注销', '003' => '查看站内信', '004' => '发送站内信', '005' => '删除站内信', '011' => '查看文件', '012' => '编辑文件', '013' => '下载文件', '014' => '查看GPS轨迹', '015' => '删除文件', '016' => '信息标注', '017' => '导出文件', '018' => '下载模板', '021' => '添加考勤', '022' => '编辑考勤', '023' => '删除考勤', '024' => '导入考勤', '031' => '添加案件', '032' => '编辑案件', '033' => '删除案件', '041' => '添加同级调阅', '042' => '删除同级调阅', '043' => '审批同级调阅', '044' => '删除同级调阅', '051' => '添加记录仪', '052' => '编辑记录仪', '054' => '记录仪报障', '055' => '记录仪报废', '056' => '删除记录仪', '057' => '更新记录仪', '058' => '启用记录仪', '061' => '添加工作站', '062' => '编辑工作站', '063' => '远程配置工作站', '064' => '全局配置工作站', '065' => '删除工作站', '071' => '添加服务器', '072' => '编辑服务器', '073' => '删除服务器', '081' => '添加单位', '082' => '编辑单位', '083' => '删除单位', '084' => '导入单位', '091' => '添加用户', '092' => '编辑用户', '093' => '修改密码', '094' => '管理范围', '095' => '停用用户', '096' => '启用用户', '097' => '删除用户', '098' => '导入用户', 101 => '添加角色', 102 => '编辑角色', 103 => '删除角色', 111 => '添加公告', 112 => '编辑公告', 113 => '删除公告', 114 => '添加工作站公告', 115 => '编辑工作站公告', 116 => '删除工作站公告', 121 => '添加系统配置项', 122 => '编辑系统配置项', 123 => '删除系统配置项', 124 => '编辑基本资料', 131 => '关联文件', 132 => '查询文件');

	public function writeLog($type, $msg, $filename = '')
	{
		$userid = $_SESSION['userid'];
		$username = $_SESSION['username'];
		$hostcode = $_SESSION['hostcode'];
		$unit_no = $_SESSION['unitcode'];
		$realname = $_SESSION['realname'];
		$onlineip = NetUtils::get_client_ip();

		if (empty($_SESSION['username'])) {
			$username = '游客';
		}

		$data = array('userid' => $userid, 'username' => $username, 'hostcode' => $hostcode, 'unit_no' => $unit_no, 'sort' => $type, 'realname' => $realname, 'context' => $msg, 'filename' => $filename, 'logtime' => time(), 'net_ip' => $onlineip);
		$this->insertRow($data);
	}
}

echo ' ';

?>
